[net]
batch=32
subdivisions=1
width=112
height=112
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

mixup=4
mosaic=1

learning_rate=0.00025
burn_in=1000
max_batches = 252000
policy=steps
steps=100000, 200000
scales=.1, .1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky



[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=96
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=48
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=25
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 6,7,8
anchors = 9.49,20.34, 13.85,52.57, 23.82,32.53, 24.00,75.83, 39.80,47.80, 44.38,89.20, 68.37,21.86, 81.26,52.41, 81.99,98.19
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
iou_loss = giou
random=1


[route]
layers=-4


[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=0
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 6
#[shortcut]
#from=6
#activation=linear

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky



[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 3, 4, 5
anchors = 9.49,20.34, 13.85,52.57, 23.82,32.53, 24.00,75.83, 39.80,47.80, 44.38,89.20, 68.37,21.86, 81.26,52.41, 81.99,98.19
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
iou_loss = giou
random=1


[route]
layers=-4

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=0
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 2

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=25
size=3
stride=1
pad=1
activation=leaky


[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 0,1,2
anchors = 9.49,20.34, 13.85,52.57, 23.82,32.53, 24.00,75.83, 39.80,47.80, 44.38,89.20, 68.37,21.86, 81.26,52.41, 81.99,98.19
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
iou_loss = giou
random=1
