[net]
batch=64
subdivisions=1
width=112
height=112
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

mixup=4
mosaic=1
data_type=center_data
learning_rate=0.0005
burn_in=1000
max_batches = 300000
policy=steps
steps=140000, 190000
scales=.1, .1

[convolutional]
batch_normalize=1
filters=8
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=16
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky


[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=48
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters= 96
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=48
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky


[upsample]
stride=2


[route]
layers=-1, 7


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky




[upsample]
stride=2

[route]
layers=-1, 3


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=5
size=1
stride=1
pad=0
activation=linear


[ctdet]
size=3
stride=1
wh=0.1
classes=1
off=1.0
jitter=0.3
hm=1.0
random=1


