[net]
batch=128
subdivisions=1
width=104
height=104
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.00025
burn_in=1000
max_batches = 252000
policy=steps
steps=100000, 200000
scales=.1, .1

[convolutional]
batch_normalize=1
filters=19
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky


[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=25
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=30
size=1
stride=1
pad=1
activation=linear

[Gaussian_yolo]
mask = 3, 4, 5
anchors =9.27,20.34, 15.47,53.10, 28.20,31.43, 32.32,73.09, 67.30,38.02, 69.31,85.90
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss = giou
random=0

[route]
layers=-4


[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 3

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky



[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=30
size=1
stride=1
pad=1
activation=linear

[Gaussian_yolo]
mask = 0, 1, 2
anchors = 9.27,20.34, 15.47,53.10, 28.20,31.43, 32.32,73.09, 67.30,38.02, 69.31,85.90
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
uc_normalizer=1.0
cls_normalizer=1.0
iou_normalizer=0.5
iou_loss = giou
random=0
