[net]
batch=64
subdivisions=1
width=112
height=112
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

mixup=4
mosaic=1

learning_rate=0.1
#learning_rate=0.00025
burn_in=1000
max_batches = 252000
policy=steps
steps=2000, 15000, 50000, 100000, 200000
scales=.1, .1, .1, .1, .1
#steps=100000, 200000
#scales=.1, .1

[convolutional]
batch_normalize=1
filters=19
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky



[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=96
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=48
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=25
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 6,7,8
anchors = 9.94,16.69, 12.60,34.33, 18.27,59.49, 30.27,76.02, 34.05,32.38, 47.01,87.46, 68.29,95.78, 88.90,49.63, 100.76,97.67
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
#iou_loss = giou
random=1

[route]
layers=-4


[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 6

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky



[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 3, 4, 5
anchors = 9.94,16.69, 12.60,34.33, 18.27,59.49, 30.27,76.02, 34.05,32.38, 47.01,87.46, 68.29,95.78, 88.90,49.63, 100.76,97.67
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
#iou_loss = giou
random=1

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 2

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=25
size=3
stride=1
pad=1
activation=leaky


[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=0
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 0,1,2
anchors = 9.94,16.69, 12.60,34.33, 18.27,59.49, 30.27,76.02, 34.05,32.38, 47.01,87.46, 68.29,95.78, 88.90,49.63, 100.76,97.67
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
#iou_loss = giou
random=1
