[net]
batch=1
subdivisions=1
width=96
height=96
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.1
burn_in=1000
max_batches = 252000
policy=steps
steps=2000, 15000, 50000, 100000, 200000
scales=.1, .1, .1, .1, .1

[convolutional]
batch_normalize=1
filters=19
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky


[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky



[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=96
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=48
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=25
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=1
activation=linear

[yolo]
mask = 6,7,8
anchors = 1.94,4.56, 5.16,11.64, 9,23.52, 12.96,45.84, 23.16,26.16, 23.4,62.4, 40.08,74.16, 54.36,35.4, 74.16,78.48
classes=1
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=0

[route]
layers=-4


[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 7

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky



[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=1
activation=linear

[yolo]
mask = 3, 4, 5
anchors = 1.94,4.56, 5.16,11.64, 9,23.52, 12.96,45.84, 23.16,26.16, 23.4,62.4, 40.08,74.16, 54.36,35.4, 74.16,78.48
classes=1
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=0

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 3

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=25
size=3
stride=1
pad=1
activation=leaky


[convolutional]
batch_normalize=1
filters=27
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=1
activation=linear

[yolo]
mask = 0,1,2
anchors = 1.94,4.56, 5.16,11.64, 9,23.52, 12.96,45.84, 23.16,26.16, 23.4,62.4, 40.08,74.16, 54.36,35.4, 74.16,78.48
classes=1
num=9
jitter=.3
ignore_thresh = .5
truth_thresh = 1
random=0
